lms-books/jmeter/GET/GetAuthourStressTest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="GetAuthourStressTest">
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">2000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiJ9.eyJpc3MiOiJleGFtcGxlLmlvIiwic3ViIjoiMixtYXJpYUBnbWFpbC5jb20iLCJleHAiOjE3MzU5ODQyMjcsImlhdCI6MTczNTk0ODIyNywicm9sZXMiOiJMSUJSQVJJQU4ifQ.LDxHWl-V4LMElQ07QI2mtEJQ5Y9ZX10IgUORnG7Sf6NptmmnQPvpGcJPKn_h6UyN171tGKhq2zX1Xl8-f-6_kBweISd-fD55vnRUQnNFxCC8avs9FYQaPQ4HN_SeNlPz0hfbKyalrA5RqktfrkaK0UzgELR7gmMV123l1VjS7V6jdXGWoLT7o69cbyvOipqiL2kShOGKwTlglfSM1XQNl3NMYsskzfT6gJLj26Kx0PjLb55-cNPfqBDH8PMzjN9oIyoSGSlawdfKa05j8ugLUHzMyE6TIg5lRxAQe0iUNrAWxIfzmva7L57Gif2HDBQlbPDpImyoCOUNxkaQ_BVi34v6ErlfU6q_sWCjsvrMOkMpfEj8eRPS3Wqew4t7a0hscGtkxlXEFW05XnWf_DgseB49feUx0_HlD3-o35sCc70u90p574DX6dmPwJNOs6yN-HJs1dNfUnizNG70fA64C2JNLJkYL3CBhQypmJ9kyOJb6K50zJ4VJeNr5x64xML_XCiVsiIJKcDymnwM9xZMAvb_f1RNP4YmTcyVCToXgYnSrTBmBFzUh7kcl5qMOz_0jix-qL8HtLAeRwYZKJD4fLp5bOFVXGaTQIpC0X5_tEkF0yGDG4XgjeynTFWGLr6UnzJJkQKzNj6x9vOYuUKsAWrehkUwdVzCnq5baPSzJMU </stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8088</stringProp>
          <stringProp name="HTTPSampler.path">/api/authors?name=Ricardo Queirós</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>